"""
地球に関する定数
----------------
============= ===== ======== =================================
Name          Abbr. Units    Description
============= ===== ======== =================================
earth_radius  a     m        地球の平均半径
earth_daysec        s        地球の自転周期
earth_omega   omega rad s^-1 地球の回転角速度
earth_gravity g     m s^-2   地球の重力加速度
============= ===== ======== =================================

乾燥空気に関する定数
--------------------
============= ======= ============ ==============================
Name          Abbr.   Units        Description
============= ======= ============ ==============================
air_Md        Md      g mol^-1     乾燥空気の分子量
air_Rd        Rd      J (K kg)^-1  乾燥空気の気体定数
air_Cp_d      Cp_d    J (K kg)^-1  乾燥空気の定圧比熱
air_Cv_d      Cv_d    J (K kg)^-1  乾燥空気の定積比熱
============= ======= ============ ==============================

水蒸気に関する定数
------------------
============= ===== =========== ==============================
Name          Abbr. Units       Description
============= ===== =========== ==============================
water_Mv      Mv    g mol^-1    水蒸気の分子量
water_Rv      Rv    J (K kg)^-1 水蒸気の気体定数
water_es_0c   es0   Pa          0度における飽和水蒸気圧
water_Lv_0c   Lv    J kg^-1     0度における水の蒸発潜熱
============= ===== =========== ==============================

気象でよく使う定数
------------------
============= ======= =========== ==============================
Name          Abbr.   Units       Description
============= ======= =========== ==============================
air_gamma     gamma               乾燥空気の比熱比 (Cp_d/Cv_d)
air_kappa     kappa               Rd/Cp_d
air_epsilon   epsilon             Rd/Rv
============= ======= =========== ==============================
"""
earth_radius = 6.37e6
earth_daysec = 86400.
earth_omega = 7.292e-5
earth_gravity = 9.81

air_Md = 28.97
air_Rd = 287.
air_Cp_d = 1004.
air_Cv_d = 717.

water_Mv = 18.016
water_Rv = 461.5
water_es_0c = 611.2
water_Lv_0c = 2.5e6

gamma_d = air_Cp_d / air_Cv_d
kappa = air_Rd / air_Cp_d
epsilon = water_Mv / air_Md
